GopalSaraf/Practicals/PSDL/include/proc/pic16f18425.inc
// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0314h
// bitfield definitions
CCPR3L_RL_POSN                           equ 0000h
CCPR3L_RL_POSITION                       equ 0000h
CCPR3L_RL_SIZE                           equ 0008h
CCPR3L_RL_LENGTH                         equ 0008h
CCPR3L_RL_MASK                           equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0315h
// bitfield definitions
CCPR3H_RH_POSN                           equ 0000h
CCPR3H_RH_POSITION                       equ 0000h
CCPR3H_RH_SIZE                           equ 0008h
CCPR3H_RH_LENGTH                         equ 0008h
CCPR3H_RH_MASK                           equ 00FFh

// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 0316h
// bitfield definitions
CCP3CON_MODE_POSN                        equ 0000h
CCP3CON_MODE_POSITION                    equ 0000h
CCP3CON_MODE_SIZE                        equ 0004h
CCP3CON_MODE_LENGTH                      equ 0004h
CCP3CON_MODE_MASK                        equ 000Fh
CCP3CON_FMT_POSN                         equ 0004h
CCP3CON_FMT_POSITION                     equ 0004h
CCP3CON_FMT_SIZE                         equ 0001h
CCP3CON_FMT_LENGTH                       equ 0001h
CCP3CON_FMT_MASK                         equ 0010h
CCP3CON_OUT_POSN                         equ 0005h
CCP3CON_OUT_POSITION                     equ 0005h
CCP3CON_OUT_SIZE                         equ 0001h
CCP3CON_OUT_LENGTH                       equ 0001h
CCP3CON_OUT_MASK                         equ 0020h
CCP3CON_EN_POSN                          equ 0007h
CCP3CON_EN_POSITION                      equ 0007h
CCP3CON_EN_SIZE                          equ 0001h
CCP3CON_EN_LENGTH                        equ 0001h
CCP3CON_EN_MASK                          equ 0080h
CCP3CON_MODE0_POSN                       equ 0000h
CCP3CON_MODE0_POSITION                   equ 0000h
CCP3CON_MODE0_SIZE                       equ 0001h
CCP3CON_MODE0_LENGTH                     equ 0001h
CCP3CON_MODE0_MASK                       equ 0001h
CCP3CON_MODE1_POSN                       equ 0001h
CCP3CON_MODE1_POSITION                   equ 0001h
CCP3CON_MODE1_SIZE                       equ 0001h
CCP3CON_MODE1_LENGTH                     equ 0001h
CCP3CON_MODE1_MASK                       equ 0002h
CCP3CON_MODE2_POSN                       equ 0002h
CCP3CON_MODE2_POSITION                   equ 0002h
CCP3CON_MODE2_SIZE                       equ 0001h
CCP3CON_MODE2_LENGTH                     equ 0001h
CCP3CON_MODE2_MASK                       equ 0004h
CCP3CON_MODE3_POSN                       equ 0003h
CCP3CON_MODE3_POSITION                   equ 0003h
CCP3CON_MODE3_SIZE                       equ 0001h
CCP3CON_MODE3_LENGTH                     equ 0001h
CCP3CON_MODE3_MASK                       equ 0008h
CCP3CON_CCP3MODE_POSN                    equ 0000h
CCP3CON_CCP3MODE_POSITION                equ 0000h
CCP3CON_CCP3MODE_SIZE                    equ 0004h
CCP3CON_CCP3MODE_LENGTH                  equ 0004h
CCP3CON_CCP3MODE_MASK                    equ 000Fh
CCP3CON_CCP3FMT_POSN                     equ 0004h
CCP3CON_CCP3FMT_POSITION                 equ 0004h
CCP3CON_CCP3FMT_SIZE                     equ 0001h
CCP3CON_CCP3FMT_LENGTH                   equ 0001h
CCP3CON_CCP3FMT_MASK                     equ 0010h
CCP3CON_CCP3OUT_POSN                     equ 0005h
CCP3CON_CCP3OUT_POSITION                 equ 0005h
CCP3CON_CCP3OUT_SIZE                     equ 0001h
CCP3CON_CCP3OUT_LENGTH                   equ 0001h
CCP3CON_CCP3OUT_MASK                     equ 0020h
CCP3CON_CCP3EN_POSN                      equ 0007h
CCP3CON_CCP3EN_POSITION                  equ 0007h
CCP3CON_CCP3EN_SIZE                      equ 0001h
CCP3CON_CCP3EN_LENGTH                    equ 0001h
CCP3CON_CCP3EN_MASK                      equ 0080h
CCP3CON_CCP3MODE0_POSN                   equ 0000h
CCP3CON_CCP3MODE0_POSITION               equ 0000h
CCP3CON_CCP3MODE0_SIZE                   equ 0001h
CCP3CON_CCP3MODE0_LENGTH                 equ 0001h
CCP3CON_CCP3MODE0_MASK                   equ 0001h
CCP3CON_CCP3MODE1_POSN                   equ 0001h
CCP3CON_CCP3MODE1_POSITION               equ 0001h
CCP3CON_CCP3MODE1_SIZE                   equ 0001h
CCP3CON_CCP3MODE1_LENGTH                 equ 0001h
CCP3CON_CCP3MODE1_MASK                   equ 0002h
CCP3CON_CCP3MODE2_POSN                   equ 0002h
CCP3CON_CCP3MODE2_POSITION               equ 0002h
CCP3CON_CCP3MODE2_SIZE                   equ 0001h
CCP3CON_CCP3MODE2_LENGTH                 equ 0001h
CCP3CON_CCP3MODE2_MASK                   equ 0004h
CCP3CON_CCP3MODE3_POSN                   equ 0003h
CCP3CON_CCP3MODE3_POSITION               equ 0003h
CCP3CON_CCP3MODE3_SIZE                   equ 0001h
CCP3CON_CCP3MODE3_LENGTH                 equ 0001h
CCP3CON_CCP3MODE3_MASK                   equ 0008h

// Register: CCP3CAP
#define CCP3CAP CCP3CAP
CCP3CAP                                  equ 0317h
// bitfield definitions
CCP3CAP_CTS_POSN                         equ 0000h
CCP3CAP_CTS_POSITION                     equ 0000h
CCP3CAP_CTS_SIZE                         equ 0008h
CCP3CAP_CTS_LENGTH                       equ 0008h
CCP3CAP_CTS_MASK                         equ 00FFh
CCP3CAP_CTS0_POSN                        equ 0000h
CCP3CAP_CTS0_POSITION                    equ 0000h
CCP3CAP_CTS0_SIZE                        equ 0001h
CCP3CAP_CTS0_LENGTH                      equ 0001h
CCP3CAP_CTS0_MASK                        equ 0001h
CCP3CAP_CTS1_POSN                        equ 0001h
CCP3CAP_CTS1_POSITION                    equ 0001h
CCP3CAP_CTS1_SIZE                        equ 0001h
CCP3CAP_CTS1_LENGTH                      equ 0001h
CCP3CAP_CTS1_MASK                        equ 0002h
CCP3CAP_CTS2_POSN                        equ 0002h
CCP3CAP_CTS2_POSITION                    equ 0002h
CCP3CAP_CTS2_SIZE                        equ 0001h
CCP3CAP_CTS2_LENGTH                      equ 0001h
CCP3CAP_CTS2_MASK                        equ 0004h
CCP3CAP_CCP3CTS_POSN                     equ 0000h
CCP3CAP_CCP3CTS_POSITION                 equ 0000h
CCP3CAP_CCP3CTS_SIZE                     equ 0008h
CCP3CAP_CCP3CTS_LENGTH                   equ 0008h
CCP3CAP_CCP3CTS_MASK                     equ 00FFh
CCP3CAP_CCP3CTS0_POSN                    equ 0000h
CCP3CAP_CCP3CTS0_POSITION                equ 0000h
CCP3CAP_CCP3CTS0_SIZE                    equ 0001h
CCP3CAP_CCP3CTS0_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS0_MASK                    equ 0001h
CCP3CAP_CCP3CTS1_POSN                    equ 0001h
CCP3CAP_CCP3CTS1_POSITION                equ 0001h
CCP3CAP_CCP3CTS1_SIZE                    equ 0001h
CCP3CAP_CCP3CTS1_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS1_MASK                    equ 0002h
CCP3CAP_CCP3CTS2_POSN                    equ 0002h
CCP3CAP_CCP3CTS2_POSITION                equ 0002h
CCP3CAP_CCP3CTS2_SIZE                    equ 0001h
CCP3CAP_CCP3CTS2_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS2_MASK                    equ 0004h

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 0318h
// bitfield definitions
CCPR4L_RL_POSN                           equ 0000h
CCPR4L_RL_POSITION                       equ 0000h
CCPR4L_RL_SIZE                           equ 0008h
CCPR4L_RL_LENGTH                         equ 0008h
CCPR4L_RL_MASK                           equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 0319h
// bitfield definitions
CCPR4H_RH_POSN                           equ 0000h
CCPR4H_RH_POSITION                       equ 0000h
CCPR4H_RH_SIZE                           equ 0008h
CCPR4H_RH_LENGTH                         equ 0008h
CCPR4H_RH_MASK                           equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 031Ah
// bitfield definitions
CCP4CON_MODE_POSN                        equ 0000h
CCP4CON_MODE_POSITION                    equ 0000h
CCP4CON_MODE_SIZE                        equ 0004h
CCP4CON_MODE_LENGTH                      equ 0004h
CCP4CON_MODE_MASK                        equ 000Fh
CCP4CON_FMT_POSN                         equ 0004h
CCP4CON_FMT_POSITION                     equ 0004h
CCP4CON_FMT_SIZE                         equ 0001h
CCP4CON_FMT_LENGTH                       equ 0001h
CCP4CON_FMT_MASK                         equ 0010h
CCP4CON_OUT_POSN                         equ 0005h
CCP4CON_OUT_POSITION                     equ 0005h
CCP4CON_OUT_SIZE                         equ 0001h
CCP4CON_OUT_LENGTH                       equ 0001h
CCP4CON_OUT_MASK                         equ 0020h
CCP4CON_EN_POSN                          equ 0007h
CCP4CON_EN_POSITION                      equ 0007h
CCP4CON_EN_SIZE                          equ 0001h
CCP4CON_EN_LENGTH                        equ 0001h
CCP4CON_EN_MASK                          equ 0080h
CCP4CON_MODE0_POSN                       equ 0000h
CCP4CON_MODE0_POSITION                   equ 0000h
CCP4CON_MODE0_SIZE                       equ 0001h
CCP4CON_MODE0_LENGTH                     equ 0001h
CCP4CON_MODE0_MASK                       equ 0001h
CCP4CON_MODE1_POSN                       equ 0001h
CCP4CON_MODE1_POSITION                   equ 0001h
CCP4CON_MODE1_SIZE                       equ 0001h
CCP4CON_MODE1_LENGTH                     equ 0001h
CCP4CON_MODE1_MASK                       equ 0002h
CCP4CON_MODE2_POSN                       equ 0002h
CCP4CON_MODE2_POSITION                   equ 0002h
CCP4CON_MODE2_SIZE                       equ 0001h
CCP4CON_MODE2_LENGTH                     equ 0001h
CCP4CON_MODE2_MASK                       equ 0004h
CCP4CON_MODE3_POSN                       equ 0003h
CCP4CON_MODE3_POSITION                   equ 0003h
CCP4CON_MODE3_SIZE                       equ 0001h
CCP4CON_MODE3_LENGTH                     equ 0001h
CCP4CON_MODE3_MASK                       equ 0008h
CCP4CON_CCP4MODE_POSN                    equ 0000h
CCP4CON_CCP4MODE_POSITION                equ 0000h
CCP4CON_CCP4MODE_SIZE                    equ 0004h
CCP4CON_CCP4MODE_LENGTH                  equ 0004h
CCP4CON_CCP4MODE_MASK                    equ 000Fh
CCP4CON_CCP4FMT_POSN                     equ 0004h
CCP4CON_CCP4FMT_POSITION                 equ 0004h
CCP4CON_CCP4FMT_SIZE                     equ 0001h
CCP4CON_CCP4FMT_LENGTH                   equ 0001h
CCP4CON_CCP4FMT_MASK                     equ 0010h
CCP4CON_CCP4OUT_POSN                     equ 0005h
CCP4CON_CCP4OUT_POSITION                 equ 0005h
CCP4CON_CCP4OUT_SIZE                     equ 0001h
CCP4CON_CCP4OUT_LENGTH                   equ 0001h
CCP4CON_CCP4OUT_MASK                     equ 0020h
CCP4CON_CCP4EN_POSN                      equ 0007h
CCP4CON_CCP4EN_POSITION                  equ 0007h
CCP4CON_CCP4EN_SIZE                      equ 0001h
CCP4CON_CCP4EN_LENGTH                    equ 0001h
CCP4CON_CCP4EN_MASK                      equ 0080h
CCP4CON_CCP4MODE0_POSN                   equ 0000h
CCP4CON_CCP4MODE0_POSITION               equ 0000h
CCP4CON_CCP4MODE0_SIZE                   equ 0001h
CCP4CON_CCP4MODE0_LENGTH                 equ 0001h
CCP4CON_CCP4MODE0_MASK                   equ 0001h
CCP4CON_CCP4MODE1_POSN                   equ 0001h
CCP4CON_CCP4MODE1_POSITION               equ 0001h
CCP4CON_CCP4MODE1_SIZE                   equ 0001h
CCP4CON_CCP4MODE1_LENGTH                 equ 0001h
CCP4CON_CCP4MODE1_MASK                   equ 0002h
CCP4CON_CCP4MODE2_POSN                   equ 0002h
CCP4CON_CCP4MODE2_POSITION               equ 0002h
CCP4CON_CCP4MODE2_SIZE                   equ 0001h
CCP4CON_CCP4MODE2_LENGTH                 equ 0001h
CCP4CON_CCP4MODE2_MASK                   equ 0004h
CCP4CON_CCP4MODE3_POSN                   equ 0003h
CCP4CON_CCP4MODE3_POSITION               equ 0003h
CCP4CON_CCP4MODE3_SIZE                   equ 0001h
CCP4CON_CCP4MODE3_LENGTH                 equ 0001h
CCP4CON_CCP4MODE3_MASK                   equ 0008h

