GopalSaraf/Practicals/PSDL/include/proc/pic16f18425.inc
// Register: MD1CON1
#define MD1CON1 MD1CON1
MD1CON1                                  equ 0898h
// bitfield definitions
MD1CON1_CLSYNC_POSN                      equ 0000h
MD1CON1_CLSYNC_POSITION                  equ 0000h
MD1CON1_CLSYNC_SIZE                      equ 0001h
MD1CON1_CLSYNC_LENGTH                    equ 0001h
MD1CON1_CLSYNC_MASK                      equ 0001h
MD1CON1_CLPOL_POSN                       equ 0001h
MD1CON1_CLPOL_POSITION                   equ 0001h
MD1CON1_CLPOL_SIZE                       equ 0001h
MD1CON1_CLPOL_LENGTH                     equ 0001h
MD1CON1_CLPOL_MASK                       equ 0002h
MD1CON1_CHSYNC_POSN                      equ 0004h
MD1CON1_CHSYNC_POSITION                  equ 0004h
MD1CON1_CHSYNC_SIZE                      equ 0001h
MD1CON1_CHSYNC_LENGTH                    equ 0001h
MD1CON1_CHSYNC_MASK                      equ 0010h
MD1CON1_CHPOL_POSN                       equ 0005h
MD1CON1_CHPOL_POSITION                   equ 0005h
MD1CON1_CHPOL_SIZE                       equ 0001h
MD1CON1_CHPOL_LENGTH                     equ 0001h
MD1CON1_CHPOL_MASK                       equ 0020h
MD1CON1_MD1CLSYNC_POSN                   equ 0000h
MD1CON1_MD1CLSYNC_POSITION               equ 0000h
MD1CON1_MD1CLSYNC_SIZE                   equ 0001h
MD1CON1_MD1CLSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CLSYNC_MASK                   equ 0001h
MD1CON1_MD1CLPOL_POSN                    equ 0001h
MD1CON1_MD1CLPOL_POSITION                equ 0001h
MD1CON1_MD1CLPOL_SIZE                    equ 0001h
MD1CON1_MD1CLPOL_LENGTH                  equ 0001h
MD1CON1_MD1CLPOL_MASK                    equ 0002h
MD1CON1_MD1CHSYNC_POSN                   equ 0004h
MD1CON1_MD1CHSYNC_POSITION               equ 0004h
MD1CON1_MD1CHSYNC_SIZE                   equ 0001h
MD1CON1_MD1CHSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CHSYNC_MASK                   equ 0010h
MD1CON1_MD1CHPOL_POSN                    equ 0005h
MD1CON1_MD1CHPOL_POSITION                equ 0005h
MD1CON1_MD1CHPOL_SIZE                    equ 0001h
MD1CON1_MD1CHPOL_LENGTH                  equ 0001h
MD1CON1_MD1CHPOL_MASK                    equ 0020h

// Register: MD1SRC
#define MD1SRC MD1SRC
MD1SRC                                   equ 0899h
// bitfield definitions
MD1SRC_MS_POSN                           equ 0000h
MD1SRC_MS_POSITION                       equ 0000h
MD1SRC_MS_SIZE                           equ 0005h
MD1SRC_MS_LENGTH                         equ 0005h
MD1SRC_MS_MASK                           equ 001Fh
MD1SRC_MS0_POSN                          equ 0000h
MD1SRC_MS0_POSITION                      equ 0000h
MD1SRC_MS0_SIZE                          equ 0001h
MD1SRC_MS0_LENGTH                        equ 0001h
MD1SRC_MS0_MASK                          equ 0001h
MD1SRC_MS1_POSN                          equ 0001h
MD1SRC_MS1_POSITION                      equ 0001h
MD1SRC_MS1_SIZE                          equ 0001h
MD1SRC_MS1_LENGTH                        equ 0001h
MD1SRC_MS1_MASK                          equ 0002h
MD1SRC_MS2_POSN                          equ 0002h
MD1SRC_MS2_POSITION                      equ 0002h
MD1SRC_MS2_SIZE                          equ 0001h
MD1SRC_MS2_LENGTH                        equ 0001h
MD1SRC_MS2_MASK                          equ 0004h
MD1SRC_MS3_POSN                          equ 0003h
MD1SRC_MS3_POSITION                      equ 0003h
MD1SRC_MS3_SIZE                          equ 0001h
MD1SRC_MS3_LENGTH                        equ 0001h
MD1SRC_MS3_MASK                          equ 0008h
MD1SRC_MS4_POSN                          equ 0004h
MD1SRC_MS4_POSITION                      equ 0004h
MD1SRC_MS4_SIZE                          equ 0001h
MD1SRC_MS4_LENGTH                        equ 0001h
MD1SRC_MS4_MASK                          equ 0010h
MD1SRC_MD1MS_POSN                        equ 0000h
MD1SRC_MD1MS_POSITION                    equ 0000h
MD1SRC_MD1MS_SIZE                        equ 0005h
MD1SRC_MD1MS_LENGTH                      equ 0005h
MD1SRC_MD1MS_MASK                        equ 001Fh
MD1SRC_MD1MS0_POSN                       equ 0000h
MD1SRC_MD1MS0_POSITION                   equ 0000h
MD1SRC_MD1MS0_SIZE                       equ 0001h
MD1SRC_MD1MS0_LENGTH                     equ 0001h
MD1SRC_MD1MS0_MASK                       equ 0001h
MD1SRC_MD1MS1_POSN                       equ 0001h
MD1SRC_MD1MS1_POSITION                   equ 0001h
MD1SRC_MD1MS1_SIZE                       equ 0001h
MD1SRC_MD1MS1_LENGTH                     equ 0001h
MD1SRC_MD1MS1_MASK                       equ 0002h
MD1SRC_MD1MS2_POSN                       equ 0002h
MD1SRC_MD1MS2_POSITION                   equ 0002h
MD1SRC_MD1MS2_SIZE                       equ 0001h
MD1SRC_MD1MS2_LENGTH                     equ 0001h
MD1SRC_MD1MS2_MASK                       equ 0004h
MD1SRC_MD1MS3_POSN                       equ 0003h
MD1SRC_MD1MS3_POSITION                   equ 0003h
MD1SRC_MD1MS3_SIZE                       equ 0001h
MD1SRC_MD1MS3_LENGTH                     equ 0001h
MD1SRC_MD1MS3_MASK                       equ 0008h
MD1SRC_MD1MS4_POSN                       equ 0004h
MD1SRC_MD1MS4_POSITION                   equ 0004h
MD1SRC_MD1MS4_SIZE                       equ 0001h
MD1SRC_MD1MS4_LENGTH                     equ 0001h
MD1SRC_MD1MS4_MASK                       equ 0010h

// Register: MD1CARL
#define MD1CARL MD1CARL
MD1CARL                                  equ 089Ah
// bitfield definitions
MD1CARL_CL_POSN                          equ 0000h
MD1CARL_CL_POSITION                      equ 0000h
MD1CARL_CL_SIZE                          equ 0004h
MD1CARL_CL_LENGTH                        equ 0004h
MD1CARL_CL_MASK                          equ 000Fh
MD1CARL_CL0_POSN                         equ 0000h
MD1CARL_CL0_POSITION                     equ 0000h
MD1CARL_CL0_SIZE                         equ 0001h
MD1CARL_CL0_LENGTH                       equ 0001h
MD1CARL_CL0_MASK                         equ 0001h
MD1CARL_CL1_POSN                         equ 0001h
MD1CARL_CL1_POSITION                     equ 0001h
MD1CARL_CL1_SIZE                         equ 0001h
MD1CARL_CL1_LENGTH                       equ 0001h
MD1CARL_CL1_MASK                         equ 0002h
MD1CARL_CL2_POSN                         equ 0002h
MD1CARL_CL2_POSITION                     equ 0002h
MD1CARL_CL2_SIZE                         equ 0001h
MD1CARL_CL2_LENGTH                       equ 0001h
MD1CARL_CL2_MASK                         equ 0004h
MD1CARL_CL3_POSN                         equ 0003h
MD1CARL_CL3_POSITION                     equ 0003h
MD1CARL_CL3_SIZE                         equ 0001h
MD1CARL_CL3_LENGTH                       equ 0001h
MD1CARL_CL3_MASK                         equ 0008h
MD1CARL_MD1CL_POSN                       equ 0000h
MD1CARL_MD1CL_POSITION                   equ 0000h
MD1CARL_MD1CL_SIZE                       equ 0004h
MD1CARL_MD1CL_LENGTH                     equ 0004h
MD1CARL_MD1CL_MASK                       equ 000Fh
MD1CARL_MD1CL0_POSN                      equ 0000h
MD1CARL_MD1CL0_POSITION                  equ 0000h
MD1CARL_MD1CL0_SIZE                      equ 0001h
MD1CARL_MD1CL0_LENGTH                    equ 0001h
MD1CARL_MD1CL0_MASK                      equ 0001h
MD1CARL_MD1CL1_POSN                      equ 0001h
MD1CARL_MD1CL1_POSITION                  equ 0001h
MD1CARL_MD1CL1_SIZE                      equ 0001h
MD1CARL_MD1CL1_LENGTH                    equ 0001h
MD1CARL_MD1CL1_MASK                      equ 0002h
MD1CARL_MD1CL2_POSN                      equ 0002h
MD1CARL_MD1CL2_POSITION                  equ 0002h
MD1CARL_MD1CL2_SIZE                      equ 0001h
MD1CARL_MD1CL2_LENGTH                    equ 0001h
MD1CARL_MD1CL2_MASK                      equ 0004h
MD1CARL_MD1CL3_POSN                      equ 0003h
MD1CARL_MD1CL3_POSITION                  equ 0003h
MD1CARL_MD1CL3_SIZE                      equ 0001h
MD1CARL_MD1CL3_LENGTH                    equ 0001h
MD1CARL_MD1CL3_MASK                      equ 0008h

// Register: MD1CARH
#define MD1CARH MD1CARH
MD1CARH                                  equ 089Bh
// bitfield definitions
MD1CARH_CH_POSN                          equ 0000h
MD1CARH_CH_POSITION                      equ 0000h
MD1CARH_CH_SIZE                          equ 0004h
MD1CARH_CH_LENGTH                        equ 0004h
MD1CARH_CH_MASK                          equ 000Fh
MD1CARH_CH0_POSN                         equ 0000h
MD1CARH_CH0_POSITION                     equ 0000h
MD1CARH_CH0_SIZE                         equ 0001h
MD1CARH_CH0_LENGTH                       equ 0001h
MD1CARH_CH0_MASK                         equ 0001h
MD1CARH_CH1_POSN                         equ 0001h
MD1CARH_CH1_POSITION                     equ 0001h
MD1CARH_CH1_SIZE                         equ 0001h
MD1CARH_CH1_LENGTH                       equ 0001h
MD1CARH_CH1_MASK                         equ 0002h
MD1CARH_CH2_POSN                         equ 0002h
MD1CARH_CH2_POSITION                     equ 0002h
MD1CARH_CH2_SIZE                         equ 0001h
MD1CARH_CH2_LENGTH                       equ 0001h
MD1CARH_CH2_MASK                         equ 0004h
MD1CARH_CH3_POSN                         equ 0003h
MD1CARH_CH3_POSITION                     equ 0003h
MD1CARH_CH3_SIZE                         equ 0001h
MD1CARH_CH3_LENGTH                       equ 0001h
MD1CARH_CH3_MASK                         equ 0008h
MD1CARH_MD1CH_POSN                       equ 0000h
MD1CARH_MD1CH_POSITION                   equ 0000h
MD1CARH_MD1CH_SIZE                       equ 0004h
MD1CARH_MD1CH_LENGTH                     equ 0004h
MD1CARH_MD1CH_MASK                       equ 000Fh
MD1CARH_MD1CH0_POSN                      equ 0000h
MD1CARH_MD1CH0_POSITION                  equ 0000h
MD1CARH_MD1CH0_SIZE                      equ 0001h
MD1CARH_MD1CH0_LENGTH                    equ 0001h
MD1CARH_MD1CH0_MASK                      equ 0001h
MD1CARH_MD1CH1_POSN                      equ 0001h
MD1CARH_MD1CH1_POSITION                  equ 0001h
MD1CARH_MD1CH1_SIZE                      equ 0001h
MD1CARH_MD1CH1_LENGTH                    equ 0001h
MD1CARH_MD1CH1_MASK                      equ 0002h
MD1CARH_MD1CH2_POSN                      equ 0002h
MD1CARH_MD1CH2_POSITION                  equ 0002h
MD1CARH_MD1CH2_SIZE                      equ 0001h
MD1CARH_MD1CH2_LENGTH                    equ 0001h
MD1CARH_MD1CH2_MASK                      equ 0004h
MD1CARH_MD1CH3_POSN                      equ 0003h
MD1CARH_MD1CH3_POSITION                  equ 0003h
MD1CARH_MD1CH3_SIZE                      equ 0001h
MD1CARH_MD1CH3_LENGTH                    equ 0001h
MD1CARH_MD1CH3_MASK                      equ 0008h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 090Ch
// bitfield definitions
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_CDAFVR_POSN                       equ 0002h
FVRCON_CDAFVR_POSITION                   equ 0002h
FVRCON_CDAFVR_SIZE                       equ 0002h
FVRCON_CDAFVR_LENGTH                     equ 0002h
FVRCON_CDAFVR_MASK                       equ 000Ch
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_CDAFVR0_POSN                      equ 0002h
FVRCON_CDAFVR0_POSITION                  equ 0002h
FVRCON_CDAFVR0_SIZE                      equ 0001h
FVRCON_CDAFVR0_LENGTH                    equ 0001h
FVRCON_CDAFVR0_MASK                      equ 0004h
FVRCON_CDAFVR1_POSN                      equ 0003h
FVRCON_CDAFVR1_POSITION                  equ 0003h
FVRCON_CDAFVR1_SIZE                      equ 0001h
FVRCON_CDAFVR1_LENGTH                    equ 0001h
FVRCON_CDAFVR1_MASK                      equ 0008h

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 090Eh
// bitfield definitions
DAC1CON0_NSS_POSN                        equ 0000h
DAC1CON0_NSS_POSITION                    equ 0000h
DAC1CON0_NSS_SIZE                        equ 0001h
DAC1CON0_NSS_LENGTH                      equ 0001h
DAC1CON0_NSS_MASK                        equ 0001h
DAC1CON0_PSS_POSN                        equ 0002h
DAC1CON0_PSS_POSITION                    equ 0002h
DAC1CON0_PSS_SIZE                        equ 0002h
DAC1CON0_PSS_LENGTH                      equ 0002h
DAC1CON0_PSS_MASK                        equ 000Ch
DAC1CON0_OE1_POSN                        equ 0005h
DAC1CON0_OE1_POSITION                    equ 0005h
DAC1CON0_OE1_SIZE                        equ 0001h
DAC1CON0_OE1_LENGTH                      equ 0001h
DAC1CON0_OE1_MASK                        equ 0020h
DAC1CON0_EN_POSN                         equ 0007h
DAC1CON0_EN_POSITION                     equ 0007h
DAC1CON0_EN_SIZE                         equ 0001h
DAC1CON0_EN_LENGTH                       equ 0001h
DAC1CON0_EN_MASK                         equ 0080h
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_PSS0_POSN                       equ 0002h
DAC1CON0_PSS0_POSITION                   equ 0002h
DAC1CON0_PSS0_SIZE                       equ 0001h
DAC1CON0_PSS0_LENGTH                     equ 0001h
DAC1CON0_PSS0_MASK                       equ 0004h
DAC1CON0_PSS1_POSN                       equ 0003h
DAC1CON0_PSS1_POSITION                   equ 0003h
DAC1CON0_PSS1_SIZE                       equ 0001h
DAC1CON0_PSS1_LENGTH                     equ 0001h
DAC1CON0_PSS1_MASK                       equ 0008h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 090Fh
// bitfield definitions
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0005h
DAC1CON1_DAC1R_LENGTH                    equ 0005h
DAC1CON1_DAC1R_MASK                      equ 001Fh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h

// Register: ZCDCON
#define ZCDCON ZCDCON
ZCDCON                                   equ 091Fh
// bitfield definitions
ZCDCON_ZCDINTN_POSN                      equ 0000h
ZCDCON_ZCDINTN_POSITION                  equ 0000h
ZCDCON_ZCDINTN_SIZE                      equ 0001h
ZCDCON_ZCDINTN_LENGTH                    equ 0001h
ZCDCON_ZCDINTN_MASK                      equ 0001h
ZCDCON_ZCDINTP_POSN                      equ 0001h
ZCDCON_ZCDINTP_POSITION                  equ 0001h
ZCDCON_ZCDINTP_SIZE                      equ 0001h
ZCDCON_ZCDINTP_LENGTH                    equ 0001h
ZCDCON_ZCDINTP_MASK                      equ 0002h
ZCDCON_ZCDPOL_POSN                       equ 0004h
ZCDCON_ZCDPOL_POSITION                   equ 0004h
ZCDCON_ZCDPOL_SIZE                       equ 0001h
ZCDCON_ZCDPOL_LENGTH                     equ 0001h
ZCDCON_ZCDPOL_MASK                       equ 0010h
ZCDCON_ZCDOUT_POSN                       equ 0005h
ZCDCON_ZCDOUT_POSITION                   equ 0005h
ZCDCON_ZCDOUT_SIZE                       equ 0001h
ZCDCON_ZCDOUT_LENGTH                     equ 0001h
ZCDCON_ZCDOUT_MASK                       equ 0020h
ZCDCON_ZCDSEN_POSN                       equ 0007h
ZCDCON_ZCDSEN_POSITION                   equ 0007h
ZCDCON_ZCDSEN_SIZE                       equ 0001h
ZCDCON_ZCDSEN_LENGTH                     equ 0001h
ZCDCON_ZCDSEN_MASK                       equ 0080h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 098Fh
// bitfield definitions
CMOUT_MC1OUT_POSN                        equ 0000h
CMOUT_MC1OUT_POSITION                    equ 0000h
CMOUT_MC1OUT_SIZE                        equ 0001h
CMOUT_MC1OUT_LENGTH                      equ 0001h
CMOUT_MC1OUT_MASK                        equ 0001h
CMOUT_MC2OUT_POSN                        equ 0001h
CMOUT_MC2OUT_POSITION                    equ 0001h
CMOUT_MC2OUT_SIZE                        equ 0001h
CMOUT_MC2OUT_LENGTH                      equ 0001h
CMOUT_MC2OUT_MASK                        equ 0002h
CMOUT_C1OUT_POSN                         equ 0000h
CMOUT_C1OUT_POSITION                     equ 0000h
CMOUT_C1OUT_SIZE                         equ 0001h
CMOUT_C1OUT_LENGTH                       equ 0001h
CMOUT_C1OUT_MASK                         equ 0001h
CMOUT_C2OUT_POSN                         equ 0001h
CMOUT_C2OUT_POSITION                     equ 0001h
CMOUT_C2OUT_SIZE                         equ 0001h
CMOUT_C2OUT_LENGTH                       equ 0001h
CMOUT_C2OUT_MASK                         equ 0002h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0990h
// bitfield definitions
CM1CON0_SYNC_POSN                        equ 0000h
CM1CON0_SYNC_POSITION                    equ 0000h
CM1CON0_SYNC_SIZE                        equ 0001h
CM1CON0_SYNC_LENGTH                      equ 0001h
CM1CON0_SYNC_MASK                        equ 0001h
CM1CON0_HYS_POSN                         equ 0001h
CM1CON0_HYS_POSITION                     equ 0001h
CM1CON0_HYS_SIZE                         equ 0001h
CM1CON0_HYS_LENGTH                       equ 0001h
CM1CON0_HYS_MASK                         equ 0002h
CM1CON0_POL_POSN                         equ 0004h
CM1CON0_POL_POSITION                     equ 0004h
CM1CON0_POL_SIZE                         equ 0001h
CM1CON0_POL_LENGTH                       equ 0001h
CM1CON0_POL_MASK                         equ 0010h
CM1CON0_OUT_POSN                         equ 0006h
CM1CON0_OUT_POSITION                     equ 0006h
CM1CON0_OUT_SIZE                         equ 0001h
CM1CON0_OUT_LENGTH                       equ 0001h
CM1CON0_OUT_MASK                         equ 0040h
CM1CON0_EN_POSN                          equ 0007h
CM1CON0_EN_POSITION                      equ 0007h
CM1CON0_EN_SIZE                          equ 0001h
CM1CON0_EN_LENGTH                        equ 0001h
CM1CON0_EN_MASK                          equ 0080h
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1EN_POSN                        equ 0007h
CM1CON0_C1EN_POSITION                    equ 0007h
CM1CON0_C1EN_SIZE                        equ 0001h
CM1CON0_C1EN_LENGTH                      equ 0001h
CM1CON0_C1EN_MASK                        equ 0080h

